drop table public."MST_権限情報";

create table public."MST_権限情報" (
    "店舗ID" character varying(20)
  , "ロール" character varying(20)
  , "権限ID" character varying(20)
  , "権限種別" character varying(20)
  , "権限区分" character varying(20)
  , "備考" character varying(500)
  , "登録日時" timestamp(6) without time zone
  , "更新日時" timestamp(6) without time zone
);

INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_01', 'btn', 'normal', 'メニュー画面　データ導入', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_02', 'btn', 'normal', 'メニュー画面　収入支出情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_03', 'btn', 'normal', 'メニュー画面　マスタ情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_04', 'btn', 'normal', 'メニュー画面　在庫情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_05', 'btn', 'normal', 'メニュー画面　販売情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_06', 'btn', 'normal', 'メニュー画面　納品情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_07', 'btn', 'normal', 'メニュー画面　仕入情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_08', 'btn', 'normal', 'メニュー画面　代行発送商品管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_09', 'btn', 'normal', 'メニュー画面　代行発送情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_10', 'btn', 'normal', 'メニュー画面　発送情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_11', 'btn', 'disable', 'メニュー画面　売上管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_12', 'btn', 'disable', 'メニュー画面　商品スキャン', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_13', 'btn', 'disable', 'メニュー画面　TODO管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_14', 'div', 'hidden', 'メニュー画面　TODOリスト', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('Smart-Bear', 'admin', '0301_15', 'div', 'hidden', 'メニュー画面　ダッシュボード', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_01', 'btn', 'disable', 'メニュー画面　データ導入', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_02', 'btn', 'disable', 'メニュー画面　収入支出情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_03', 'btn', 'disable', 'メニュー画面　マスタ情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_04', 'btn', 'disable', 'メニュー画面　在庫情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_05', 'btn', 'disable', 'メニュー画面　販売情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_06', 'btn', 'disable', 'メニュー画面　納品情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_07', 'btn', 'disable', 'メニュー画面　仕入情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_08', 'btn', 'normal', 'メニュー画面　代行発送商品管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_09', 'btn', 'normal', 'メニュー画面　代行発送情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_10', 'btn', 'disable', 'メニュー画面　発送情報管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_11', 'btn', 'disable', 'メニュー画面　売上管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_12', 'btn', 'disable', 'メニュー画面　商品スキャン', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_13', 'btn', 'disable', 'メニュー画面　TODO管理', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_14', 'div', 'disable', 'メニュー画面　TODOリスト', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0301_15', 'div', 'disable', 'メニュー画面　ダッシュボード', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0901_01', 'btn', 'disable', '代行発送商品管理画面　新規', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0901_02', 'btn', 'disable', '代行発送商品管理画面　更新', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0901_03', 'btn', 'disable', '代行発送商品管理画面　削除', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0902_01', 'btn', 'normal', '代行発送商品詳細画面　表示', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0902_02', 'btn', 'disable', '代行発送商品詳細画面　保存', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '0902_03', 'btn', 'disable', '代行発送商品詳細画面　キャンセル', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '1001_01', 'btn', 'normal', '代行発送情報管理画面　新規', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '1001_02', 'btn', 'normal', '代行発送情報管理画面　更新', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '1001_03', 'btn', 'normal', '代行発送情報管理画面　削除', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '1002_01', 'btn', 'hidden', '代行発送情報詳細画面　受入', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '1002_02', 'btn', 'normal', '代行発送情報詳細画面　保存', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
INSERT INTO "MST_権限情報" ("店舗ID", "ロール", "権限ID", "権限種別", "権限区分", "備考", "登録日時", "更新日時") VALUES ('zhixun', 'admin', '1002_03', 'btn', 'normal', '代行発送情報詳細画面　キャンセル', '0001-01-01 00:00:00', '0001-01-01 00:00:00');
